Autodesk.Revit.DB.Domain
Type of connector domain.
Enumeration of connector domain types

Autodesk.Revit.DB.Domain.DomainCableTrayConduit
Connector of Structural Analytical Model

Autodesk.Revit.DB.Domain.DomainPiping
Connector of cable trays or conduits

Autodesk.Revit.DB.Domain.DomainElectrical
Electrical connector

Autodesk.Revit.DB.Domain.DomainHvac
HVAC (duct) connector

Autodesk.Revit.DB.Domain.DomainUndefined
Domain is undefined